<?php


//============== ①「echo 1 + 2 * 3 - 4 / 2;」の答えを予測 =============

//          回答：　５（*や/が優先される）

//===================================================================

//=========================== ② =======================================

// ユーザーの年齢に基づいて、成人か未成年かを判断するPHPコードを書いてください。
// 年齢は変数$ageに格納されているとします。
// 条件演算子（三項演算子）を使用してください。

// 回答：

//$age = mt_rand(2, 35); <- 「mt_rand()関数は今後のバージョンによっては推奨されなさそう。。」
$age = random_int(2, 35);

// 三項演算子を用いて年齢（18歳未満か）を判別し結果を出力
echo $age.'歳です'.'<br>';
echo ($age < 18)? '未成年です' : '成人です';

//===================================================================
